* HansTausen_Dome
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | HansTausen_Dome
Place name                       | Hans Tausen Dome
Geographic location              | North Greenland
Site type                        | Ice cap
Data Source                      | E. Welty, Issue #50, and Reeh, Niels, ed. Report on Activities and Results 1993-1995 for Hans Tausen Ice Cap Project: Glacier and Climate Change Research, North Greenland. 1995. Fig. 6.
Data DOI                         | 
Science Source                   | Zekollari, Harry, Huybrechts, Philippe, Noël, Brice, van de Berg, Willem Jan, van den Broeke, Michiel R.: Sensitivity, stability and future evolution of the world’s northernmost ice cap, Hans Tausen Iskappe (Greenland) , The Cryosphere 11(2), Copernicus GmbH, 805–825, 3 2017 
Science DOI                      | 10.5194/tc-11-805-2017
Date                             | 1995
Longitude [°E]                   | -37.47
Latitude [°N]                    | 82.51
Location Source                  | 10.5194/essd-14-2209-2022
Depth of top measurement [m]     | 12.0
Depth of bottom measurement [m]  | 341
Ice thickness [m]                | 345
Coverage [% of thickness]        | 95
Ice thickness source             | See data source
Note                             | Drill date: 10.34194/bullggu.v172.6749 
#+end_example

** Temperature

+ From E. Welty https://github.com/GEUS-Glaciology-and-Climate/greenland_ice_borehole_temperature_profiles/issues/50

** Thickness

+ From [[citet:zekollari_2017][Zekollari (2017)]] text.
 
** Location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|       d |       t |
|  11.687 | -19.438 |
|  20.163 | -20.845 |
|  30.235 | -20.779 |
|  40.316 | -20.704 |
|  60.547 | -20.491 |
|  81.209 | -20.265 |
| 100.547 | -20.107 |
| 119.968 | -19.872 |
| 139.407 | -19.621 |
| 159.693 | -19.357 |
| 179.618 | -19.043 |
| 199.565 | -18.707 |
| 219.535 |  -18.35 |
| 239.455 |  -18.04 |
| 259.439 | -17.671 |
| 279.876 | -17.268 |
| 299.796 | -16.957 |
| 321.048 | -16.571 |
| 340.528 | -16.282 |

